src/main/resources/xml/SetAvisoViaje/SetAvisoViaje_soap1_1-request.xml


<soap:Envelope xmlns:xsi="https://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="https://www.w3.org/2001/XMLSchema" xmlns:soap="https://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <SetAvisoViaje xmlns="https://tempuri.org/">
            <cardNumber>string</cardNumber>
            <accountNumber>string</accountNumber>
            <accountComponent>string</accountComponent>
            <dateFrom>string</dateFrom>
            <dateUntil>string</dateUntil>
            <codCountry>string</codCountry>
            <desCountry>string</desCountry>
            <userId>string</userId>
            <programId>string</programId>
        </SetAvisoViaje>
    </soap:Body>
</soap:Envelope>

<!--        POST /serviceconsulta.asmx HTTP/1.1-->
<!--        Host: wscabalindividuosdev.cabal.coop-->
<!--        Content-Type: text/xml; charset=utf-8-->
<!--        Content-Length: length-->
<!--        SOAPAction: "https://tempuri.org/SetAvisoViaje"-->

<!--        <?xml version="1.0" encoding="utf-8"?>-->
<!--        HTTP/1.1 200 OK-->
<!--        Content-Type: text/xml; charset=utf-8-->
<!--        Content-Length: length-->